d=Uam+awgn(Uam,20); %加小噪声，信噪比为20
op=fft(d,960);
mm=abs(op);
figure(8)
subplot(2,1,1);plot(t,d);
title('加小噪声后得到AM信号时域波形'); %加小噪声后得到AM信号时域波形
subplot(2,1,2);plot(f(1:N/2),mm(1:N/2));
title('加小噪声后得到AM信号频域波形'); %加小噪声后得到AM信号频域波形

vb=demod(d,fc,Fs,'am'); %加小噪声后解调
figure(9)
subplot(2,1,1);plot(t,vb);
title('加小噪声后解调得到信号时域波形'); %加小噪声后解调得到信号时域波形fg=fft(vb,960);
fg=fft(vb,960);     %进行傅里叶变换
ty=abs(fg);
subplot(2,1,2);
plot(f(1:N/2),ty(1:N/2));
title('加小噪声后解调得到信号频域波形');  %加小噪声后解调得到信号频域波

% 可以看出解调后噪声依然对信号有影响，也出现了一些失真，但基本可以看出原波形;
% 解调将频率搬回到原频率，噪声对频率的影响很小，出现了一些失真，但是中心频率还是没有变;
% 可以看出不同功率的噪声对信号的影响不同，噪声功率越大，对信号的影响也越大。

